flow-past-cylinder/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet_top
    { 
        type            fixedValue;
        value           uniform (0.054 0 0);
    }
    inlet_bot
    { 
        type            fixedValue;
        value           uniform (0.054 0 0);
    }
    outlet_top
    {
        type        zeroGradient;
    }
    outlet_bot
    {
        type        zeroGradient;
    }
    walls
    {
        type        fixedValue;
        value       uniform (0 0 0);
    }
    obstacle
    {
        type        fixedValue;
        value       uniform (0 0 0);
    }
    frontAndBack
    {
        type        empty;
    }
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
