flow-past-cylinder/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet_top
    {
        type    zeroGradient;
    }
    inlet_bot
    {
        type    zeroGradient;
    }
    outlet_top
    {
        type    fixedValue;
        value   uniform 0;
    }
    outlet_bot
    {
        type    fixedValue;
        value   uniform 0;
    }
    walls
    {
        type    zeroGradient;
    }
    obstacle
    {
        type    zeroGradient;
    }
    frontAndBack
    {
        type    empty;
    }
}
