flow-past-cylinder/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
solvers
{
    "(p|U|k|epsilon)"
    {
        solver      GAMG;
        tolerance   1e-06;
        relTol      0;

        smoother    GaussSeidel;

        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator faceAreaPair;
        mergeLevels 1;
    };
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    consistent true; // SIMPLEC

    residualControl
    {
        "(p|U|k|epsilon)" 1e-08;
    }
}

relaxationFactors
{
    p               0.5;
    U               0.1;
    k               0.3;
    epsilon         0.3;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
